{
  "Bạn chưa kết nối với nhãn hàng này.": "You've not connected with this brand.",
  "Bạn không có quyền truy cập.": "You don't have an access right.",
  "Chờ duyệt": "Waiting for approval",
  "Chờ giao": "Waiting for delivery",
  "Các sản phẩm dưới đây có sự thay đổi về giá bán. Quý khách vui lòng kiểm tra lại giỏ hàng.": "Below products have change in price. Please check your cart again.",
  "Các sản phẩm dưới đây không còn tồn tại. Quý khách vui lòng xem lại giỏ hàng và xóa bỏ những sản phẩm không tồn tại.": "Below products do not exist. Please check your cart and remove these ones.",
  "Có sản phẩm khuyến mãi không tồn tại": "Some promotion products don't exist",
  "Có sản phẩm không tồn tại. Vui lòng kiểm tra lại": "Some products don't exist. Please check again",
  "Cửa hàng chưa hỗ trợ giao hàng trong ngày, vui lòng chọn ngày giao hàng khác.": "Store doesn't support delivery within day, please choose another delivery date.",
  "Cửa hàng của bạn không được hỗ trợ hoặc thông tin kết nối không đúng": "Your store hasn't been supported or connection information is not correct",
  "Danh mục không đúng định dạng": "Catalog is in invalid format",
  "Danh sách sản phẩm thay thế không đúng định dạng": "Exchangable product list is in invalid format",
  "Danh sách sản phẩm thay thế là thông tin bắt buộc": "Exchangable product list is required",
  "Gọi người khác nhận hàng không đúng định dạng": "Another receipt contact is in invalid format",
  "Hoàn thành": "Completed",
  "Hết thời gian giao hàng, vui lòng chọn ngày khác.": "Delivery time is over, please choose another date.",
  "Họ tên người nhận hộ là thông tin bắt buộc": "Fullname of receivable person is required",
  "ID sản phẩm khuyến mãi không đúng định dạng": "Promotion product ID is in invalid format",
  "ID sản phẩm khuyến mãi là bắt buộc": "Promotion product ID is required",
  "ID sản phẩm không đúng định dạng": "Product ID is in invalid format",
  "ID sản phẩm là thông tin bắt buộc": "Product ID is required",
  "Id đơn hàng là thông tin bắt buộc.": "Order ID is required",
  "Khuyến mãi đã được đăng kí.": "Promotion was registered.",
  "Không tìm thấy giỏ hàng": "Cart not found.",
  "Không tìm thấy ngày làm việc trong tuần.": "Working day in week not found.",
  "Không tìm thấy sản phẩm": "Product not found",
  "Không tìm thấy sản phẩm khuyến mãi": "Promotion product not found",
  "Không tìm thấy thông tin kết nối": "Connection information not found",
  "Không tìm thấy thông tin người dùng": "User information not found",
  "Không tìm thấy thông tin outlet": "Store information not found",
  "Không tìm thấy đơn hàng.": "Order not found.",
  "Không xác định": "Undefined",
  "Kiểu dữ liệu của id đơn hàng không hợp lệ.": "Data type of Order ID is invalid.",
  "Kiểu dữ liệu của số trang không hợp lệ.": "Data type of page number is invalid.",
  "Kiểu dữ liệu không hợp lệ.": "Data type is invalid.",
  "Kiểu dữ liệu loại báo cáo không hợp lệ": "Data type of report is invalid",
  "Kiểu dữ liệu loại nguồn đơn hàng không hợp lệ": "Data type of order source is invalid",
  "Kiểu dữ liệu mã khuyến mãi không hợp lệ": "Data type of promotion code is invalid",
  "Kiểu dữ liệu trạng thái khuyến mãi không hợp lệ": "Data type of promotion code is invalid",
  "Kiểu dữ liệu trạng thái đơn hàng không hợp lệ.": "Data type of order status is invalid.",
  "Kiểu mã mức đăng kí dữ liệu mã khuyến mãi không hợp lệ": "Data type of promotion registration code is invalid",
  "Loại báo cáo là thông tin bắt buộc": "Report type is required",
  "Loại câu hỏi là thông tin bắt buộc.": "Question type is required.",
  "Lấy chi tiết khuyến mãi thất bại.": "Getting detail promotion unsuccessfully.",
  "Lấy chính sach bảo mật thất bại.": "Getting privacy policy unsuccessfully",
  "Lấy câu hỏi hỗ trợ thất bại.": "Getting question for support unsuccessfully",
  "Lấy danh sách khuyến mãi thất bại.": "Getting promotion list unsuccessfully.",
  "Lấy danh sách mốc thời gian giao hàng thất bại.": "Getting delivery date list  unsuccessfully",
  "Lấy danh sách ngày làm việc thất bại.": "Getting working day list unsuccessfully",
  "Lấy danh sách phần thưởng khuyến mãi thất bại.": "Getting promotion reward list unsuccessfully.",
  "Lấy nhân viên hỗ trợ thất bại": "Getting support staff unsuccessfully",
  "Lấy thông tin chi tiết đơn hàng thất bại.": "Getting detail order information unsuccessfully.",
  "Lấy điều khoản sử dụng thất bại.": "Getting terms of use unsuccessfully",
  "Mua": "Buy",
  "Mua lớn hơn": "Buy more than",
  "Mua ít nhất": "Buy at least",
  "Mã câu hỏi là thông tin bắt buộc.": "Question code is required.",
  "Mã công ty/ tài khoản là thông tin bắt buộc": "Company/Account code is required",
  "Mã cửa hàng/ kho hàng là thông tin bắt buộc": "Store/warehouse code is required",
  "Mã giỏ hàng không đúng định dạng": "Cart code is in invalid format",
  "Mã giỏ hàng là thông tin bắt buộc": "Cart code is required",
  "Mã khuyến mãi là thông tin bắt buộc": "Promotion code is required",
  "Mã kết nối là thông tin bắt buộc": "Connection code is required",
  "Mã mức đăng kí khuyến mãi là thông tin bắt buộc": "Promotion Registration code is required",
  "Mã đơn hàng là thông tin bắt buộc.": "Order code is required.",
  "Ngày bắt đầu không đúng định dạng": "Start date is in invalid format",
  "Ngày bắt đầu không đúng định dạng.": "Start date is in invalid format",
  "Ngày bắt đầu để lọc khuyến mãi không đúng định dạng": "Start date to filter promotion is in invalid format",
  "Ngày giao hàng đã chọn là ngày nghỉ, vui lòng chọn ngày giao hàng khác.": "Delivery time is over, please choose another date.",
  "Ngày kết thúc không đúng định dạng": "End date is in invalid format",
  "Ngày kết thúc không đúng định dạng.": "End date is in invalid format",
  "Ngày kết thúc lọc đơn hàng phải lớn hơn hoặc bằng ngày bắt đầu lọc.": "End date must be greater than or equal to start date",
  "Ngày kết thúc để lọc khuyến mãi không đúng định dạng": "End date to filter promotion is in invalid format",
  "Ngày nhận hàng không đúng định dạng": "Receipt date is in invalid format",
  "Ngày nhận hàng là thông tin bắt buộc": "Receipt date is required",
  "Ngày nhận hàng phải lớn hơn ngày hiện tại": "Receipt date must be greater than the current date",
  "Page không đúng định dạng": "Page is in invalid format",
  "Phân loại sản phẩm không đúng định dạng": "Product category is in invalid format",
  "Phân loại sản phẩm là thông tin bắt buộc": "Product category is required",
  "Sản phẩm không đúng định dạng": "Product is in invalid format",
  "Sản phẩm là thông tin bắt buộc": "Product is required",
  "Số lượng sản phẩm không hợp lệ. Vui lòng kiểm tra lại": "Number of products is invalid. Please check again",
  "Số điện thoại người nhận hộ là thông tin bắt buộc": "Phone number of receivable person is required",
  "Thanh toán khi nhận hàng": "Pay as receiving goods",
  "Thời gian giao hàng chưa được cài đặt.": "Delivery time isn't set up.",
  "Trạng thái của khuyến mãi là thông tin bắt buộc": "Promotion status is required",
  "Trạng thái đơn hàng là thông tin bắt buộc.": "Order status is required.",
  "Type không đúng. Type phải là một trong các giá trị sau: \"promo\", \"bestbuy\" hoặc \"\"": "Type is incorrect. Type must be one of following values: \"promo\", \"bestbuy\" or \"\"",
  "Từ chối": "Be rejected",
  "Xảy ra lỗi. Vui lòng thử lại sau": "There is error. Please try again.",
  "nhóm sản phẩm :group_name": "Product group :group_name",
  "save_keyword không đúng định dạng": "save_keyword is in invalid format",
  "sản phẩm :item_name": "product :item_name",
  "Đang giao": "In delivering",
  "Điều kiện :index: :break_level_by_operator :total :ratio_product_name": "Conditions :index :break_level_by_operator :total :ratio_product_name",
  "Điều kiện :index: :break_level_by_operator :total VNĐ :ratio_product_name": "Conditions: index :break_level_by_operator :total VNĐ :ratio_product_name",
  "Điều kiện :index: :break_level_name": "Conditions :index :break_level_name",
  "Điều kiện :index: :break_level_by_operator :total% :ratio_product_name": "",
  "Đã hủy": "Cancelled",
  "Đã trả": "Be returned",
  "Đăng kí chương trình khuyến mãi thất bại.": "Registering promotion program unsuccessfully.",
  "Khoảng cách giữa vị trí chụp ảnh của bạn với vị trí kết nối thương hiệu hoặc được cập nhật trong các lần chụp ảnh trước đó. Vui lòng cập nhật lại vị trí hoặc liên hệ với nhân viên phụ trách để tiếp tục tải ảnh lên": "The distance between your uploading photo location and the brand connection location or location updated in previous uploading photos. Please update the location or contact saleman to continue uploading photos",
  "Bạn chỉ được phép tải lên :remain ảnh nữa. Tuy nhiên, số lượng tải lên của bạn đã vượt quá số lượng được phép": "You only have :remain more times to upload photos. However, This of uploading  has exceeded the allowed times."
}
